cavityTest/cavity/cavity60_rk/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss cubic;
    grad(p)         Gauss cubic;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss cubic;
        div(U)      Gauss cubic;
    div((nuEff*dev2(T(grad(U))))) Gauss cubic;
}

laplacianSchemes
{
    default         Gauss cubic orthogonal;
}

interpolationSchemes
{
    default         cubic;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
